Catalogs/НастройкиАвтозагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиАвтозагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСоответствий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПроверкиРеестров</v8:Type>
						<v8:Type>cfg:CatalogRef.ФорматыЗагрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.НастройкиСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайловДляОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогПеремещенныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьРанееЗаписанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогОшибочныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиАвтозагрузки/Ext/ManagerModule.bsl
Функция Используемые() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиАвтозагрузки.Ссылка КАК Ссылка,
	                      |	НастройкиАвтозагрузки.Организация КАК Организация,
	                      |	НастройкиАвтозагрузки.Автор КАК Автор,
	                      |	НастройкиАвтозагрузки.НастройкаСоответствий КАК НастройкаСоответствий,
	                      |	НастройкиАвтозагрузки.КаталогФайловДляОбработки КАК КаталогФайловДляОбработки,
	                      |	НастройкиАвтозагрузки.КаталогПеремещенныхФайлов КАК КаталогПеремещенныхФайлов,
	                      |	НастройкиАвтозагрузки.КаталогОшибочныхФайлов КАК КаталогОшибочныхФайлов,
	                      |	НастройкиАвтозагрузки.ОбновлятьРанееЗаписанные КАК ОбновлятьРанееЗаписанные
	                      |ИЗ
	                      |	Справочник.НастройкиАвтозагрузки КАК НастройкиАвтозагрузки
	                      |ГДЕ
	                      |	НастройкиАвтозагрузки.ПометкаУдаления = ЛОЖЬ
	                      |	И НастройкиАвтозагрузки.Используется = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НастройкиАвтозагрузки.Приоритет");
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;

КонецФункции // ()

Функция МаскиРеестров() Экспорт

	МаскаРеестров = Новый Массив(3);
	МаскаРеестров[0] = "*.xls";
	МаскаРеестров[1] =  "*.xlsx"; 
	МаскаРеестров[2] = "*.ods";
	
	Возврат МаскаРеестров;

КонецФункции // ()

Функция НайтиРеестры(КаталогФайловДляОбработки, Маска) Экспорт

	Возврат НайтиФайлы(КаталогФайловДляОбработки, Маска, Истина);

КонецФункции // ()

Функция ПрочитатьРеестрВТабличныйДокумент(Реестр) Экспорт

	ДанныеФайла = Новый Структура;
	ДанныеФайла.Вставить("Расширение", Реестр.Расширение);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(Реестр.ПолноеИмя);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	ДанныеФайла.Вставить("АдресХранилища", АдресХранилища);
	
	Ответ = Новый Структура;
	Ответ.Вставить("Результат", Истина);
	Ответ.Вставить("Таблица", Неопределено);
	
	Попытка
	
		ПолеИсходнойТаблицы = УправлениеЗагрузкойСервер.ПрочитатьФайлВТабличныйДокумент(
			ДанныеФайла
		);
		
		Ответ["Таблица"] = ПолеИсходнойТаблицы;
	
	Исключение
		Ответ["Результат"] = Ложь;
		ОписаниеОшибки = УправленияСообщениями.СформироватьТекстОшибки(
			ИнформацияОбОшибке(),
			"Не удалось прочитать файл"
		);
		
		Ответ["Ошибка"] = ОписаниеОшибки["Выражение"];
		Ответ["СтекОшибки"] = ОписаниеОшибки["Стек"];
	КонецПопытки;
	
	Возврат Ответ;

КонецФункции // ()

Функция ОбщиеНастройки(НастройкаСоответствий, Источник) Экспорт

	Менеджер = МенеджерСоответствий(НастройкаСоответствий);
	Данные = Менеджер.ОбщиеСведения(НастройкаСоответствий);
	ЗаполнитьЗначенияСвойств(Данные, Источник);
	
	Возврат Данные;

КонецФункции // ()

Процедура ОбработатьНастройку(НастройкаСоответствий, НастройкаЗагрузки, ТабличныйДокумент) Экспорт

	Менеджер = МенеджерСоответствий(НастройкаСоответствий);
	Менеджер.ОбработатьНастройку(
		НастройкаСоответствий,
		НастройкаЗагрузки,
		ТабличныйДокумент
	);

КонецПроцедуры

Функция ОбработатьОшибку(НастройкаСоответствий, ИнформацияОбОшибке) Экспорт

	Менеджер = МенеджерСоответствий(НастройкаСоответствий);
	Возврат Менеджер.ОбработатьОшибку(ИнформацияОбОшибке);

КонецФункции // ()


#Область Техническая

Функция МенеджерСоответствий(НастройкаСоответствий)

	ИмяСоответствия = НастройкаСоответствий.Метаданные().Имя;
	Возврат Справочники[ИмяСоответствия];

КонецФункции // ()


#КонецОбласти
